/************************************************************************/
/*																		*/
/*	コマンドラインから引数配列への変換									*/
/*	Ver1.00	2009/04/04 13:17:57	作成									*/
/*																		*/
/************************************************************************/

#	include	<stdlib.h>													/* 標準ライブラリ関数*/
#	include	<string.h>													/* 標準文字列関数*/
#	include	"db2.h"														/* プログラム内汎用データベースシステム*/
#	include	"lin2arg2.h"												/* コマンドラインから引数配列への変換*/

/************************************************************************/
/*	ローカル定義														*/
/************************************************************************/

#	define	SKPSP(P)		((P)+strspn(P,"\t "))						/* スペース、タブのスキップ*/

/************************************************************************/
/*	コマンドラインから引数配列への変換									*/
/************************************************************************/

char	**lin2arg( const char *cmdlin ){

	const char	*txtp;
	char		*strp, **argv;
	char		*stre;
	int			argn=0;
	int			i;

	txtp=cmdlin;
	for(;;){
		txtp=SKPSP( txtp );
		if( !*txtp ){
			break;
		}
		txtp=dbGetDQ( 0, 0, txtp );										// ダブルクォーテーションで囲まれた文字列の次を得る
		argn++;
	}
	argv=malloc( (argn+1)*4 );
	strp=malloc( txtp-cmdlin+1 );
	stre=strp+(txtp-cmdlin+1);
	txtp=cmdlin;
	for( i=0; i<argn; i++ ){
		argv[i]=strp;
		txtp=dbGetDQ( strp, stre-strp, SKPSP( txtp ) );					// ダブルクォーテーションで囲まれた文字列を得る
		while( *strp++ );
	}
	argv[i]=0;
	return( argv );
}

